app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "Hello world!"], ["created_at", "2019-04-01 15:36:44.911779"], ["updated_at", "2019-04-01 15:36:44.911779"], ["user_id", 1]]
---
  def create
    # @post = Post.create(post_params)
    @post = current_user.posts.build(post_params)
    @post.save

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all