app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@test.com"], ["password", "test"], ["created_at", "2018-09-25 09:53:32.330494"], ["updated_at", "2018-09-25 09:53:32.330494"]]
---
  def create
    @user = User.new(post_params)
    if @user.save