app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create

    build_resource(sign_up_params)
    resource.save

    yield resource if block_given?
    if resource.persisted?
      Photo.create!(user_id: 1 image: params[:user][:image]) unless params[:user][:image].nil?